Revit 2027 API
TableView.GetCalculatedValueText Method
 Gets the calculated value text for a cell from the instance view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetCalculatedValueText(
	SectionType sectionType,
	int row,
	int column
)
Public Function GetCalculatedValueText (
	sectionType As SectionType,
	row As Integer,
	column As Integer
) As String
public:
String^ GetCalculatedValueText(
	SectionType sectionType,
	int row,
	int column
)
member GetCalculatedValueText :
        sectionType : SectionType *
        row : int *
        column : int -> string
Parameters
sectionType SectionType
 The section type.
row Int32
 The row.
column Int32
 The column.
Return Value
String
 The calculated value text.
Exceptions
Exception | Condition
ArgumentException |  The sectionType is not a valid type for this view.
ArgumentOutOfRangeException |  The given row number row is invalid. -or- The given column number column is invalid. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace